app/views/posts/show.html.erb

SELECT "comentarios".* FROM "comentarios"  WHERE "comentarios"."post_id" = ?  [["post_id", 1]]
---
<h1>Comentarios</h1>
<%= @post.comentarios.each do |comentario| %>