app/controllers/categoria_posts_controller.rb

  def index
    @categoria_posts = CategoriaPost.all
---
SELECT "categoria_posts".* FROM "categoria_posts"

  def create
    @categoria_post = CategoriaPost.new(categoria_post_params)
    @categoria_post.save
---
INSERT INTO "categoria_posts" ("created_at", "nombre", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-10 00:51:18.448694"], ["nombre", "Pentest"], ["updated_at", "2014-11-10 00:51:18.448694"]]

    def set_categoria_post
      @categoria_post = CategoriaPost.find(params[:id])
---
SELECT  "categoria_posts".* FROM "categoria_posts"  WHERE "categoria_posts"."id" = ? LIMIT 1  [["id", 1]]