app/controllers/comentarios_controller.rb

  def index
    @comentarios = Comentario.all
---
SELECT "comentarios".* FROM "comentarios"

  def create
    @comentario = Comentario.new(comentario_params)
    @comentario.save
---
INSERT INTO "comentarios" ("created_at", "cuerpo", "fecha_creacion", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-10 01:07:37.137284"], ["cuerpo", "test - comentario"], ["fecha_creacion", "2014-11-10"], ["post_id", 1], ["updated_at", "2014-11-10 01:07:37.137284"], ["user_id", 1]]

    def set_comentario
      @comentario = Comentario.find(params[:id])
---
SELECT  "comentarios".* FROM "comentarios"  WHERE "comentarios"."id" = ? LIMIT 1  [["id", 1]]