app/controllers/posts_controller.rb

INSERT INTO "posts" ("contenido", "created_at", "fecha", "imagen", "titulo", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["contenido", "dasdad"], ["created_at", "2014-11-10 00:55:55.463182"], ["fecha", "2014-11-10"], ["imagen", ""], ["titulo", "asdad"], ["updated_at", "2014-11-10 00:55:55.463182"], ["user_id", 3]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "categoria_id" = ?, "titulo" = ?, "updated_at" = ?, "user_id" = ? WHERE "posts"."id" = 1  [["categoria_id", 1], ["titulo", "test"], ["updated_at", "2014-11-09 23:58:18.775942"], ["user_id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)